/////////////////////////////////////////////////////
// PBR郢晢ｽｩ郢ｧ・､郢昴・縺・ｹ晢ｽｳ郢ｧ・ｰ鬮｢・｢闖ｫ繧・・隶堤洸ﾂ・ｰ闖ｴ阮呻ｽ堤ｸｺ・ｾ邵ｺ・ｨ郢ｧ竏壺螺郢晏･繝｣郢敖郢晢ｽｼ郢晁ｼ斐＜郢ｧ・､郢晢ｽｫ
/////////////////////////////////////////////////////

#ifndef _PBRLIGHTING_STRUCT_H_
#define _PBRLIGHTING_STRUCT_H_

// 郢昴・縺・ｹ晢ｽｬ郢ｧ・ｯ郢ｧ・ｷ郢晢ｽｧ郢晢ｽｳ郢晢ｽｩ郢ｧ・､郢晏沺・ｧ遏ｩﾂ・ｰ闖ｴ阮卍繝ｻstruct DirectionalLight
{
    float3 direction;   // 郢晢ｽｩ郢ｧ・､郢晏現繝ｻ隴・ｽｹ陷ｷ繝ｻ    int castShadow;     // 陟厄ｽｱ郢ｧ蛛ｵ縺冗ｹ晢ｽ｣郢ｧ・ｹ郢晏現笘・ｹｧ蜈ｷ・ｼ繝ｻ    float4 color;       // 郢晢ｽｩ郢ｧ・､郢晏現繝ｻ豼ｶ・ｲ
};
// 郢晄亢縺・ｹ晢ｽｳ郢晏現ﾎ帷ｹｧ・､郢昴・struct PointLight
{
    float3 position;        // 陟趣ｽｧ隶薙・    float3 positionInView;  // 郢ｧ・ｫ郢晢ｽ｡郢晢ｽｩ驕ｨ・ｺ鬮｢阮吶堤ｸｺ・ｮ陟趣ｽｧ隶薙・    float3 color;           // 郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ
    float3 attn;            // 雋ょｹ・ｽ｡・ｰ郢昜ｻ｣ﾎ帷ｹ晢ｽ｡郢晢ｽｼ郢ｧ・ｿ邵ｲ繝ｻ};
// 郢ｧ・ｹ郢晄亢繝｣郢晏現ﾎ帷ｹｧ・､郢昴・struct SpotLight
{
    float3 position;        // 陟趣ｽｧ隶薙・    int isUse;              // 闖ｴ・ｿ騾包ｽｨ闕ｳ・ｭ郢晁ｼ釆帷ｹｧ・ｰ邵ｲ繝ｻ    float3 positionInView;  // 郢ｧ・ｫ郢晢ｽ｡郢晢ｽｩ驕ｨ・ｺ鬮｢阮吶堤ｸｺ・ｮ陟趣ｽｧ隶灘生ﾂ繝ｻ    int no ;                // 郢晢ｽｩ郢ｧ・､郢晏現繝ｻ騾｡・ｪ陷ｿ・ｷ邵ｲ繝ｻ    float3 direction;       // 陝・・繝ｻ隴・ｽｹ陷ｷ莉｣ﾂ繝ｻ    float range;            // 陟厄ｽｱ鬮ｻ・ｿ驕ｽ繝ｻ蟲・ｸｲ繝ｻ    float3 color;           // 郢晢ｽｩ郢ｧ・､郢晏現繝ｻ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ繝ｻ    float3 color2;          // 闔蠕娯命騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ繝ｻ    float3 color3;          // 闕ｳ蟲ｨ笆ｽ騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ繝ｻ    float3 directionInView; // 郢ｧ・ｫ郢晢ｽ｡郢晢ｽｩ驕ｨ・ｺ鬮｢阮吶堤ｸｺ・ｮ陝・・繝ｻ隴・ｽｹ陷ｷ莉｣ﾂ繝ｻ    float3 rangePow;        // 髴肴辨螻ｬ邵ｺ・ｫ郢ｧ蛹ｻ・玖怦蟲ｨ繝ｻ陟厄ｽｱ鬮ｻ・ｿ驍・・竊馴ｏ・ｯ闕ｵ蜉ｱ笘・ｹｧ荵昴Τ郢晢ｽｩ郢晢ｽ｡郢晢ｽｼ郢ｧ・ｿ郢晢ｽｼ邵ｲ繝ｻ.0邵ｺ・ｧ驍ｱ螢ｼ・ｽ・｢邵ｺ・ｮ陞溽甥蝟ｧ郢ｧ蛛ｵ笘・ｹｧ荵敖繝ｻ                            // x邵ｺ蠕｡・ｸﾂ邵ｺ・､騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲千ｸｺ蠕｡・ｺ蠕娯命騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲醍ｸｺ蠕｡・ｸ蟲ｨ笆ｽ騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ繝ｻ    float3 angle;           // 陝・・繝ｻ髫苓ｲ橸ｽｺ・ｦ(陷雁・ｽｽ謳ｾ・ｼ螢ｹﾎ帷ｹｧ・ｸ郢ｧ・｢郢晢ｽｳ邵ｲ・ｹ邵ｺ蠕｡・ｸﾂ邵ｺ・､騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲千ｸｺ蠕｡・ｺ蠕娯命騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲醍ｸｺ蠕｡・ｸ蟲ｨ笆ｽ騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ)邵ｲ繝ｻ    float3 anglePow;        // 郢ｧ・ｹ郢晄亢繝｣郢晏現ﾎ帷ｹｧ・､郢晏現竊堤ｸｺ・ｮ髫苓ｲ橸ｽｺ・ｦ邵ｺ・ｫ郢ｧ蛹ｻ・玖怦蟲ｨ繝ｻ陟厄ｽｱ鬮ｻ・ｿ驍・・竊馴ｏ・ｯ闕ｵ蜉ｱ笘・ｹｧ荵昴Τ郢晢ｽｩ郢晢ｽ｡郢晢ｽｼ郢ｧ・ｿ邵ｲ繝ｻ.0邵ｺ・ｧ驍ｱ螢ｼ・ｽ・｢邵ｺ・ｫ陞溽甥蝟ｧ邵ｺ蜷ｶ・狗ｸｲ繝ｻ                            // x邵ｺ蠕｡・ｸﾂ邵ｺ・､騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲千ｸｺ蠕｡・ｺ蠕娯命騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ縲醍ｸｺ蠕｡・ｸ蟲ｨ笆ｽ騾ｶ・ｮ邵ｺ・ｮ郢ｧ・ｫ郢晢ｽｩ郢晢ｽｼ邵ｲ繝ｻ};
#endif // _PBRLIGHTING_STRUCT_H_